{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/alexbaturo/Desktop/jpr/ReplicationFile/log_appendix.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Jul 2021, 10:42:53

{com}. do "/var/folders/h1/2snwzn456fn65_lntc_1khf80000gn/T//SD00411.000000"
{txt}
{com}. 
. ******************************************************************************************************
. ******************************************************************************************************
. *                                       Appendix to                                         *       
. *    Baturo and Tolstrup   - Incumbent Takeovers -  Journal of Peace Research         STATA 12.1                          *                                                                             *
. ******************************************************************************************************
. ******************************************************************************************************
. 
. 
. clear
{txt}
{com}. 
. /*************************************************/
. /* Figure 1: Time Coverage by Various Indicators */
. /*************************************************/
. 
. 
. 
. use appendix/indicators
{txt}
{com}. gsort -rank
{txt}
{com}. sencode indicator, gen(indicator2)
{txt}
{com}. gsort -indicator2
{txt}
{com}. 
.    twoway (rbar starty endy indicator2, horizontal barwidth(.001) bcolor(gs1) ), ///
>    ylabel(1(1)13, labsize(small) valuelabel  angle(0))  ytitle("") ///
>   xlabel(1920(10)2020) scheme(s1mono) xtitle("") xlabel( , labsize(small) angle(45)) legend(off) xsize(8) ysize(5) graphr(m(l-1 ))
{res}{txt}
{com}. 
. graph export appendix/indicators.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/indicators.pdf written in PDF format)

{com}. 
. clear 
{txt}
{com}. 
. 
. /*******************************************************/
. /* Figure 2: Differences in takeover estimates (years) */
. /*******************************************************/
. 
. 
. use estimation_file
{txt}
{com}. 
. /* takediff.pdf for all regimes */
. hist  diff if num_indicator!=1, percent width(1) start(0) xtitle("Takeover Estimates, Differences in Years") ///
>  start(0) ytitle("Percent" "of leaders", ///
> ) ylabel(0(5)35, angle(0)) xlabel(0(2)15) scheme(s1mono) plotr(m(l-2 r+2)) 
{txt}(bin={res}16{txt}, start={res}0{txt}, width={res}1{txt})
{res}{txt}
{com}. 
. graph export appendix/takediff.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/takediff.pdf written in PDF format)

{com}. 
. 
. /*******************************************************/
. /* Figure 3: Takeover Events, 1918Ð2019 */
. /*******************************************************/
. /* Code in appendix/map_appendix.R to produce Figure 3 */ 
. 
. 
. 
. /*******************************************************/
. /* Figure 4: Time from entry into office */
. /*******************************************************/
. 
. 
. /* timeto.pdf for all regimes */
. hist  timeto if timeto<20, percent width(1) start(0) xtitle("Time to Takeover, Years from Entry into Office") ///
>  start(0) ytitle("Percent" "of leaders", ///
> ) ylabel(0(5)25, angle(0)) xlabel(0(2)16) scheme(s1mono) plotr(m(l-2 r+2)) 
{txt}(bin={res}18{txt}, start={res}0{txt}, width={res}1{txt})
{res}{txt}
{com}. 
. graph export appendix/timeto.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/timeto.pdf written in PDF format)

{com}. 
. 
. /***********************************************/
. /*   Table 1 Descriptive Stats                  */
. /***********************************************/
. 
. tabstat tenure, stats(mean, sd)

{txt}{ralign 12:variable} {...}
{c |}      mean        sd
{hline 13}{c +}{hline 20}
{ralign 12:tenure} {...}
{c |}{...}
 {res} 13.43666  10.06145
{txt}{hline 13}{c BT}{hline 20}

{com}. tabstat tenure if endy!=2019, stats(mean sd min max)

{txt}{ralign 12:variable} {...}
{c |}      mean        sd       min       max
{hline 13}{c +}{hline 40}
{ralign 12:tenure} {...}
{c |}{...}
 {res} 12.88505  10.04269  .1450068  52.13406
{txt}{hline 13}{c BT}{hline 40}

{com}. tabstat tenure if entrydem==1, stats(mean sd min)

{txt}{ralign 12:variable} {...}
{c |}      mean        sd       min
{hline 13}{c +}{hline 30}
{ralign 12:tenure} {...}
{c |}{...}
 {res} 10.49983  7.159156  1.088919
{txt}{hline 13}{c BT}{hline 30}

{com}. tabstat tenure if entrydem==0, stats(mean sd max)

{txt}{ralign 12:variable} {...}
{c |}      mean        sd       max
{hline 13}{c +}{hline 30}
{ralign 12:tenure} {...}
{c |}{...}
 {res} 15.26364  11.13786  52.13406
{txt}{hline 13}{c BT}{hline 30}

{com}. tabstat timeto, stats(mean sd)

{txt}{ralign 12:variable} {...}
{c |}      mean        sd
{hline 13}{c +}{hline 20}
{ralign 12:timeto} {...}
{c |}{...}
 {res} 3.620072  4.018719
{txt}{hline 13}{c BT}{hline 20}

{com}. tabstat timeto if entrydem==1, stats(mean sd min max)

{txt}{ralign 12:variable} {...}
{c |}      mean        sd       min       max
{hline 13}{c +}{hline 40}
{ralign 12:timeto} {...}
{c |}{...}
 {res} 3.915888  3.472592         0        17
{txt}{hline 13}{c BT}{hline 40}

{com}. tabstat timeto if entrydem==0, stats(mean sd min max)

{txt}{ralign 12:variable} {...}
{c |}      mean        sd       min       max
{hline 13}{c +}{hline 40}
{ralign 12:timeto} {...}
{c |}{...}
 {res} 3.436047  4.323401         0        29
{txt}{hline 13}{c BT}{hline 40}

{com}. 
. tabstat diff if num_indicator!=1, stats(mean, sd)

{txt}{ralign 12:variable} {...}
{c |}      mean        sd
{hline 13}{c +}{hline 20}
{ralign 12:diff} {...}
{c |}{...}
 {res} 3.466667  3.851342
{txt}{hline 13}{c BT}{hline 20}

{com}. tabstat diff if entrydem==1 & num_indicator!=1, stats(mean sd )

{txt}{ralign 12:variable} {...}
{c |}      mean        sd
{hline 13}{c +}{hline 20}
{ralign 12:diff} {...}
{c |}{...}
 {res}        3  3.330302
{txt}{hline 13}{c BT}{hline 20}

{com}. tabstat diff if entrydem==0 & num_indicator!=1, stats(mean sd)

{txt}{ralign 12:variable} {...}
{c |}      mean        sd
{hline 13}{c +}{hline 20}
{ralign 12:diff} {...}
{c |}{...}
 {res} 3.797468  4.170654
{txt}{hline 13}{c BT}{hline 20}

{com}. 
. /**************************************************/
. ///***     summary stats for discussion in text   ***///
> /*******************************************************/
. 
. gen takeover=1
{txt}
{com}. recode year1 (1920/1929=1920) (1930/1939=1930) (1940/1949=1940) (1950/1959=1950) (1960/1969=1960) (1970/1979=1970) (1980/1989=1980) (1990/1999=1990) (2000/2009=2000) (2010/2019=2010), gen(decade)
{txt}(245 differences between year1 and decade)

{com}. tabstat takeover, by(decade) stats(n)

{txt}Summary for variables: takeover
{col 6}by categories of: decade (RECODE of year1 (year1))

{ralign 8:decade} {...}
{c |}         N
{hline 9}{c +}{hline 10}
{ralign 8:1919} {...}
{c |}{...}
 {res}        2
{txt}{ralign 8:1920} {...}
{c |}{...}
 {res}       15
{txt}{ralign 8:1930} {...}
{c |}{...}
 {res}       22
{txt}{ralign 8:1940} {...}
{c |}{...}
 {res}       16
{txt}{ralign 8:1950} {...}
{c |}{...}
 {res}       34
{txt}{ralign 8:1960} {...}
{c |}{...}
 {res}       43
{txt}{ralign 8:1970} {...}
{c |}{...}
 {res}       43
{txt}{ralign 8:1980} {...}
{c |}{...}
 {res}       26
{txt}{ralign 8:1990} {...}
{c |}{...}
 {res}       39
{txt}{ralign 8:2000} {...}
{c |}{...}
 {res}       23
{txt}{ralign 8:2010} {...}
{c |}{...}
 {res}       16
{txt}{hline 9}{c +}{hline 10}
{ralign 8:Total} {...}
{c |}{...}
 {res}      279
{txt}{hline 9}{c BT}{hline 10}

{com}. 
. bysort year: egen yeartakeover=sum(takeover)
{txt}
{com}. tabstat yeartakeover, stats(mean median n)

{txt}{ralign 12:variable} {...}
{c |}      mean       p50         N
{hline 13}{c +}{hline 30}
{ralign 12:yeartakeover} {...}
{c |}{...}
 {res} 4.283154         4       279
{txt}{hline 13}{c BT}{hline 30}

{com}. 
. tabstat takeover if entrydem==1, by(decade) stats(n)

{txt}Summary for variables: takeover
{col 6}by categories of: decade (RECODE of year1 (year1))

{ralign 8:decade} {...}
{c |}         N
{hline 9}{c +}{hline 10}
{ralign 8:1919} {...}
{c |}{...}
 {res}        1
{txt}{ralign 8:1920} {...}
{c |}{...}
 {res}        5
{txt}{ralign 8:1930} {...}
{c |}{...}
 {res}       10
{txt}{ralign 8:1940} {...}
{c |}{...}
 {res}        4
{txt}{ralign 8:1950} {...}
{c |}{...}
 {res}        7
{txt}{ralign 8:1960} {...}
{c |}{...}
 {res}        9
{txt}{ralign 8:1970} {...}
{c |}{...}
 {res}       14
{txt}{ralign 8:1980} {...}
{c |}{...}
 {res}        5
{txt}{ralign 8:1990} {...}
{c |}{...}
 {res}       26
{txt}{ralign 8:2000} {...}
{c |}{...}
 {res}       14
{txt}{ralign 8:2010} {...}
{c |}{...}
 {res}       12
{txt}{hline 9}{c +}{hline 10}
{ralign 8:Total} {...}
{c |}{...}
 {res}      107
{txt}{hline 9}{c BT}{hline 10}

{com}. 
. 
. 
. 
. 
. /*************************************************************/
. ///***    Figure 5: Takeovers Over Time: 3 subplots ***/
> /*************************************************************/
. 
. 
. /**************************************************/
. /*             over time      VDEM                */
. /*******************************************************/
. 
. clear 
{txt}
{com}. use estimation_file
{txt}
{com}. gen takeover=1
{txt}
{com}.  gen dem0=takeover if v2x_regime==0
{txt}(152 missing values generated)

{com}. gen dem1=takeover if v2x_regime==1
{txt}(160 missing values generated)

{com}.  gen dem2=takeover if v2x_regime==2 | v2x_regime==3
{txt}(247 missing values generated)

{com}.  
. /* gen dem3=takeover if v2x_regime==3  only two cases */
. 
. 
. by year1, sort: egen dem0y=sum(dem0)
{txt}
{com}. by year1, sort: egen dem1y=sum(dem1)
{txt}
{com}. by year1, sort: egen dem2y=sum(dem2)
{txt}
{com}. 
. 
. graph twoway  lowess dem0y year1, lpattern(solid) lcolor(black) || lowess dem1y year1, lpattern(shortdash) ///
> lcolor(black) lwidth(medium) ///
> || lowess dem2y year1 , lpattern(solid)  lwidth(thin) lcolor(red) ///
> || line dem0y year1, lpattern(solid)  lwidth(vthin) lcolor(gs12)  ///
> || line dem1y year1, lpattern(dash)  lwidth(vthin)  lcolor(gs12) ///
> || line dem2y year1, lpattern(dash)  lwidth(vvthin)  lcolor(red) ///
> xlabel(1920(10)2020, valuelabel angle(45)) ///
> ylabel(0(1)6, valuelabel angle(360)) ///
> plotregion(margin(r+1 t+0.5)) ///
> xtitle("Year") ytitle("Takeover")   scheme(s1mono) ///
> legend(order(1 2 3) label(1 "Closed autocracy") label(2 "Electoral autocracy") ///
>  label(3 "Electoral democracy")  ///
>              size(small) region(lstyle(none)))
{res}{txt}
{com}. 
. 
. graph export appendix/timeline_vdem.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/timeline_vdem.pdf written in PDF format)

{com}. 
. 
.    /*****************************************************************/
. ///***            over time   BMR                     ***///
> /*****************************************************************/
. 
. 
. gen dddem=takeover if e_boix_regime==1
{txt}(235 missing values generated)

{com}. gen ddnodem=takeover if e_boix_regime==0
{txt}(68 missing values generated)

{com}. by year1, sort: egen dddemy=sum(dddem)
{txt}
{com}. by year1, sort: egen ddnodemy=sum(ddnodem)
{txt}
{com}. 
. 
. graph twoway  lowess dddemy year1 , lpattern(solid) || ///
> lowess ddnodemy year1 , lpattern(shortdash) ///
> lcolor(black) lwidth(medium) ///
> || line dddemy year1 , lpattern(solid)  lwidth(thin) lcolor(gs12)  ///
>  || line ddnodemy year1 , lpattern(shortdash) lcolor(gs12) ///
> xlabel(1920(5)2010, valuelabel angle(45)) ///
> ylabel(0(1)6, valuelabel angle(360)) ///
> plotregion(margin(r+1 t+0.5)) ///
> xtitle("Year") ytitle("Takeover")   scheme(s1mono) ///
> legend(order(2 1) label(1 "Democracy") label(2 "Dictatorship") ///
>              size(small) region(lstyle(none)))
{res}{txt}
{com}. 
. graph export appendix/timeline_bmr.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/timeline_bmr.pdf written in PDF format)

{com}. 
. 
. /*******************************************/
. /* Overtime in dem and nodem per N states */
. /*******************************************/
. 
. 
. clear
{txt}
{com}. use estimation_file
{txt}
{com}. replace year=year1
{txt}(0 real changes made)

{com}. sort year
{txt}
{com}. merge year using appendix/statenum, nokeep
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} year
does not uniquely identify observations in
the master data
{p_end}

{com}. drop _merge
{txt}
{com}. save estimation_file, replace
{txt}file estimation_file.dta saved

{com}. gen takeover=1
{txt}
{com}. 
. gen takeoverdem=1 if entrydem==1
{txt}(172 missing values generated)

{com}. gen takeovernodem=1 if entrydem==0
{txt}(107 missing values generated)

{com}. bysort year1: egen numeventsdem=sum(takeoverdem)
{txt}
{com}. bysort year1: egen numeventsnodem=sum(takeovernodem)
{txt}
{com}. gen numeventsdem2=(numeventsdem/statenum)*100
{txt}
{com}. gen numeventsnodem2=(numeventsnodem/statenum)*100            
{txt}
{com}. 
. graph twoway  lowess numeventsnodem2 year1,  lpattern(solid) lcolor(black) ///
> || lowess numeventsdem2 year1, lpattern(dash)  lwidth(thin) lcolor(black) ///
> || line numeventsnodem2 year1, lpattern(solid)  lwidth(vthin) lcolor(gs12)  ///
> || line numeventsdem2 year1, lpattern(dash)  lwidth(vthin)  lcolor(gs12) ///
> xlabel(1920(10)2020, valuelabel angle(45)) ///
> ylabel(0(2)8, valuelabel angle(360)) ///
> plotregion(margin(r+1 t+0.5))  xsize(8) ysize(5) ///
> xtitle("Year") ytitle("Per cent of events per number of states")   scheme(s1mono) legend(order(1 2) ///
>  label(1 "Nondemocratic")  label(2 "More democratic at entry") ///
>              size(vsmall) region(lstyle(none)))
{res}{txt}
{com}. 
. graph export appendix/timeline_dem_nodem_statenum.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/timeline_dem_nodem_statenum.pdf written in PDF format)

{com}. 
. 
. 
. 
. /**************************************************/
. ///***   Table 2: FH recodes in appendix   */  ***///
> /*******************************************************/
. 
. clear
{txt}
{com}. use Figure2/fh2020
{txt}
{com}. egen timein=concat(starty endy), punct(-)
{txt}
{com}. egen rulertime=concat(ruler timein), punct(" (")
{txt}
{com}. egen rulercountry=concat(rulertime country), punct("), ")
{txt}
{com}. sort change year rulercountry
{txt}
{com}. listtex rulercountry year change if reason2=="concentration of power"   using appendix/table2.tex, replace end(\\) missnum(--)
{txt}
{com}. 
. 
. 
.   /**************************************************/
. ///***    Table 3: GWF recodes in appendix*/  ***///
> /*******************************************************/
. 
. clear
{txt}
{com}. use estimation_file
{txt}
{com}. sort country year1
{txt}
{com}. listtex rulercountry  gwfstart gwfend gwf if gwf!=gwfstart & gwf!=starty using appendix/table3.tex, replace end(\\) missnum(--)
{txt}
{com}. 
. 
. 
.   /**************************************************/
. ///***    Table 4: PRW recodes in appendix*/  ***///
> /*******************************************************/
. 
. clear
{txt}
{com}. use appendix/rulers_prw
{txt}
{com}. 
. /* egen timein=concat(starty endy), punct(-)
> egen rulertime=concat(ruler timein), punct(" (")
> egen rulercountry=concat(rulertime country), punct("), ") */
. 
. listtex rulercountry year1 year2 bigwhy  using appendix/table4.tex, replace end(\\) missnum(--)
{txt}
{com}. 
. 
. 
. /***********************************************/
. ///***  Table 5:  types of takeovers          ***///
> /***********************************************/  
.  
. clear
{txt}
{com}. use estimation_file
{txt}
{com}. 
. /* Table of takeovers */
. tab bigwhy , sort

                               {txt}bigwhy {c |}      Freq.     Percent        Cum.
{hline 38}{c +}{hline 35}
                 term limits extended {c |}{res}         68       24.37       24.37
   {txt}exec. power concentration, various {c |}{res}         61       21.86       46.24
{txt}parliam. suspended/unconst. dissolved {c |}{res}         35       12.54       58.78
{txt}election rigged, suspended or delayed {c |}{res}         32       11.47       70.25
         {txt}purge or repression, various {c |}{res}         32       11.47       81.72
   {txt}opposition banned, i.e., one party {c |}{res}         26        9.32       91.04
             {txt}emergency or martial law {c |}{res}         18        6.45       97.49
                   {txt}royal dictatorship {c |}{res}          7        2.51      100.00
{txt}{hline 38}{c +}{hline 35}
                                Total {c |}{res}        279      100.00
{txt}
{com}. tab bigwhy if entrydem==1, sort

                               {txt}bigwhy {c |}      Freq.     Percent        Cum.
{hline 38}{c +}{hline 35}
                 term limits extended {c |}{res}         30       28.04       28.04
   {txt}exec. power concentration, various {c |}{res}         23       21.50       49.53
{txt}election rigged, suspended or delayed {c |}{res}         18       16.82       66.36
{txt}parliam. suspended/unconst. dissolved {c |}{res}         15       14.02       80.37
         {txt}purge or repression, various {c |}{res}          8        7.48       87.85
             {txt}emergency or martial law {c |}{res}          6        5.61       93.46
   {txt}opposition banned, i.e., one party {c |}{res}          4        3.74       97.20
                   {txt}royal dictatorship {c |}{res}          3        2.80      100.00
{txt}{hline 38}{c +}{hline 35}
                                Total {c |}{res}        107      100.00
{txt}
{com}. tab bigwhy if  entrydem==0, sort

                               {txt}bigwhy {c |}      Freq.     Percent        Cum.
{hline 38}{c +}{hline 35}
   exec. power concentration, various {c |}{res}         38       22.09       22.09
                 {txt}term limits extended {c |}{res}         38       22.09       44.19
         {txt}purge or repression, various {c |}{res}         24       13.95       58.14
   {txt}opposition banned, i.e., one party {c |}{res}         22       12.79       70.93
{txt}parliam. suspended/unconst. dissolved {c |}{res}         20       11.63       82.56
{txt}election rigged, suspended or delayed {c |}{res}         14        8.14       90.70
             {txt}emergency or martial law {c |}{res}         12        6.98       97.67
                   {txt}royal dictatorship {c |}{res}          4        2.33      100.00
{txt}{hline 38}{c +}{hline 35}
                                Total {c |}{res}        172      100.00
{txt}
{com}. 
. tab gwf_regimetype if  entrydem==1

         {txt}gwf_regimetype {c |}      Freq.     Percent        Cum.
{hline 24}{c +}{hline 35}
                     NA {c |}{res}         25       34.25       34.25
      {txt}indirect military {c |}{res}          1        1.37       35.62
               {txt}military {c |}{res}          1        1.37       36.99
      {txt}military-personal {c |}{res}          1        1.37       38.36
               {txt}monarchy {c |}{res}          2        2.74       41.10
              {txt}oligarchy {c |}{res}          1        1.37       42.47
                  {txt}party {c |}{res}         10       13.70       56.16
         {txt}party-personal {c |}{res}          4        5.48       61.64
               {txt}personal {c |}{res}         27       36.99       98.63
                {txt}warlord {c |}{res}          1        1.37      100.00
{txt}{hline 24}{c +}{hline 35}
                  Total {c |}{res}         73      100.00
{txt}
{com}. tab gwf_regimetype if  entrydem==0

         {txt}gwf_regimetype {c |}      Freq.     Percent        Cum.
{hline 24}{c +}{hline 35}
      indirect military {c |}{res}          2        1.38        1.38
               {txt}military {c |}{res}          8        5.52        6.90
      {txt}military-personal {c |}{res}         21       14.48       21.38
               {txt}monarchy {c |}{res}          8        5.52       26.90
              {txt}olirarchy {c |}{res}          1        0.69       27.59
                  {txt}party {c |}{res}         15       10.34       37.93
         {txt}party-military {c |}{res}          6        4.14       42.07
{txt}party-military-personal {c |}{res}          3        2.07       44.14
         {txt}party-personal {c |}{res}         14        9.66       53.79
{txt}party-personal-military {c |}{res}          3        2.07       55.86
               {txt}personal {c |}{res}         64       44.14      100.00
{txt}{hline 24}{c +}{hline 35}
                  Total {c |}{res}        145      100.00
{txt}
{com}. 
. /***********************************************************/
. ///***  Figure 6: Type of Takeover                        *///
> /************************************************************/ 
. /* Main categories of takeovers, (no more than one event per leader */
. 
. 
. /*takeover_leaders_cats */
. gen democ=1 if entrydem==1 
{txt}(172 missing values generated)

{com}. gen nodemoc=1 if entrydem==0
{txt}(107 missing values generated)

{com}. 
. graph hbar (sum) nodemoc democ, over(bigwhy, sort(1) label(labsize(small)) ) ///
>    bargap(-10)  ylabel(0(10)40, labsize(small) angle(0))  ///
>                scheme(s1mono) bar(1,color(black)) bar(2,color(gs11))  ///
>                graphregion(margin(l+2 )) ///
>              legend(order(1 2) label(1 "Nondemocratic") label(2 "More democratic at entry") ///
>              size(vsmall) region(lstyle(none))) 
{res}{txt}
{com}. 
. graph export appendix/takeover_leaders_cats.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/takeover_leaders_cats.pdf written in PDF format)

{com}. 
. 
. /***********************************************************/
. ///***  Figure 7: Difference in Power Concentration Scores *///
> /***********************************************************/ 
. 
. clear
{txt}
{com}. use appendix/takeovers_scales
{txt}
{com}. 
. hist xconst_diff2, percent width(0.5) xtitle("Executive Constraints (XCONST)") scheme(s1mono)
{txt}(bin={res}14{txt}, start={res}-6{txt}, width={res}.5{txt})
{res}{txt}
{com}. graph export appendix/xconst_diff.pdf, replace 
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/xconst_diff.pdf written in PDF format)

{com}. hist v2x_horacc_diff2, percent width(0.25)  xtitle("Horizontal Accountability") scheme(s1mono) 
{txt}(bin={res}10{txt}, start={res}-1.9860001{txt}, width={res}.25{txt})
{res}{txt}
{com}. graph export appendix/horacc_diff.pdf, replace 
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/horacc_diff.pdf written in PDF format)

{com}. hist v2xnp_pres_diff2, percent width(0.1) start(-0.2) xtitle("Presidentialism, Systemic Concentration of Political Power") scheme(s1mono) 
{txt}(bin={res}8{txt}, start={res}-.2{txt}, width={res}.1{txt})
{res}{txt}
{com}. graph export appendix/pres_diff.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/pres_diff.pdf written in PDF format)

{com}. hist polconiii_diff2, percent width(0.1) xtitle ("Political Constraints (Polcon III)") scheme(s1mono) 
{txt}(bin={res}11{txt}, start={res}-.63038623{txt}, width={res}.1{txt})
{res}{txt}
{com}. graph export appendix/polcon_diff.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/polcon_diff.pdf written in PDF format)

{com}. 
. 
.  /*****************************************************************************/
. ///***   Figure 8: Changes in Power and Prior Power Concentration Scores      ***///
> /**********************************************************************************/
. 
. clear
{txt}
{com}. use appendix/takeovers_scales
{txt}
{com}. 
. graph box xconst_diff2 if y_1_xconst!=1, over(y_1_xconst) ytitle("Change in Constraints") ///
> b1title("Prior Executive Constraints (XCONST)") scheme(s1mono)
{res}{txt}
{com}. graph export appendix/xconst_distances.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/xconst_distances.pdf written in PDF format)

{com}. 
. tabstat y_1_v2x_horacc, stats(min p25 p50 p75 max)

{txt}{ralign 12:variable} {...}
{c |}       min       p25       p50       p75       max
{hline 13}{c +}{hline 50}
{ralign 12:y_1_v2x_ho~c} {...}
{c |}{...}
 {res}   -1.889     -.809     -.349      .154     2.044
{txt}{hline 13}{c BT}{hline 50}

{com}. 
. gen horacc_4parts=1 if y_1_v2x_horacc<-.809 & y_1_v2x_horacc!=.
{txt}(210 missing values generated)

{com}. replace horacc_4parts=2 if y_1_v2x_horacc>=-.809 & y_1_v2x_horacc!=.
{txt}(207 real changes made)

{com}. replace horacc_4parts=3 if y_1_v2x_horacc>=-.349 & y_1_v2x_horacc!=.
{txt}(138 real changes made)

{com}. replace horacc_4parts=4 if y_1_v2x_horacc>=.154 & y_1_v2x_horacc!=.
{txt}(69 real changes made)

{com}. 
. graph box v2x_horacc_diff2, over(horacc_4parts, relabel(1 "min-p25" 2 "p25-p50" 3 "p50-p75" 4 "p75-max")) ///
> b1title("Prior Horizontal Accountability") ytitle("Change in Accountability") ///
> marker(1, msymbol(none) mlabel( ruler)) scheme(s1mono)
{res}{txt}
{com}. graph export appendix/horacc_distances.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/horacc_distances.pdf written in PDF format)

{com}. 
. 
.  /**********************************************************************************/
. ///* Figure 9: Difference in Power Concentration Scores, Different Takeover Events */
>  /**********************************************************************************/
. 
. clear
{txt}
{com}. use appendix/takeovers_scales
{txt}
{com}. 
. graph hbar (mean) v2x_horacc_diff2, over(bigwhy, sort(1) label(labsize(small)) ) ///
> ytitle("Average Change in Horizontal Accountability") scheme(s1mono)
{res}{txt}
{com}. graph export appendix/horacc_cats.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/horacc_cats.pdf written in PDF format)

{com}. 
. graph hbar (mean) xconst_diff2, over(bigwhy, sort(1) label(labsize(small)) ) ///
> ytitle("Average Change in Executive Constraints") scheme(s1mono)
{res}{txt}
{com}. graph export appendix/xconst_cats.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/xconst_cats.pdf written in PDF format)

{com}. 
. 
. 
. 
. /************************************************************************/
. ///***   Table 6: Incumbent Takeovers, Autogolpes, Tenure Extensions */  ***///
> /*****************************************************************************/
. 
. clear
{txt}
{com}. use estimation_file
{txt}
{com}. 
. /*egen timein=concat(starty endy), punct(--)
> egen rulertime=concat(ruler timein), punct(" (")
> egen rulercountry=concat(rulertime country), punct("), ") */
. 
. 
. /* X stands for an agreement b/w two indicators */
. gen year22=year2 if year2!=year1
{txt}(182 missing values generated)

{com}. gen x="x" if year22!=.
{txt}(182 missing values generated)

{com}. replace x="--" if x==""
{txt}x was {res}str1{txt} now {res}str2
{txt}(182 real changes made)

{com}. sort country year1
{txt}
{com}. /* time in office label */
. gen year2b=year2
{txt}
{com}. replace year2b=year2-1900 if year2<2000
{txt}(230 real changes made)

{com}. replace year2b=year2-2000 if year2>1999
{txt}(49 real changes made)

{com}. replace year2b=2000 if year2b==0
{txt}(3 real changes made)

{com}. gen year1b=year1
{txt}
{com}. tostring year1b, gen(when1)
{txt}when1 generated as {res:str4}

{com}. egen when2=concat(year1 year2b) if year2!=year1, punct("--") 
{txt}(182 missing values generated)

{com}. replace when2=when1 if when2==""
{txt}(182 real changes made)

{com}. 
. 
. listtex rulercountry when2 autogolpe_powell pacl autocoups_pipe agcoup_marshall inc_svolik haggard baturo neldaterm dd_incumb fh vdem gwf prw1 x    using appendix/table6.tex, replace end(\\) missnum(--)
{txt}
{com}. 
. clear
{txt}
{com}. 
. 
. 
. /***********************************************/
. ///**                 Figure descriptive all  ***************/
>  /***********************************************/  
. 
. 
. clear
{txt}
{com}. use estimation_file
{txt}
{com}. 
. gsort -starty
{txt}
{com}. sencode rulercountry , gen(ruler2)
{txt}
{com}. gen order=0 in 1/55
{txt}(224 missing values generated)

{com}. replace order=1 in 56/110
{txt}(55 real changes made)

{com}. replace order=2 in 111/166
{txt}(56 real changes made)

{com}. replace order=3 in 167/222
{txt}(56 real changes made)

{com}. replace order=4 in 223/279
{txt}(57 real changes made)

{com}. 
. replace year1=minyear
{txt}(0 real changes made)

{com}. replace year2=maxyear
{txt}(0 real changes made)

{com}. 
. 
. /* when takeover is same year as endyear, not visible in figure, make 3months in black for visualisation */
. gen year11=year1
{txt}
{com}. replace year11=1992.7 if ruler=="Serrano Elias"
{txt}(1 real change made)

{com}. replace year11=2011.7 if ruler=="Tadic"
{txt}(1 real change made)

{com}. replace year11=2004.7 if ruler=="Kumaratunga"
{txt}(1 real change made)

{com}. replace year11=1976.7 if ruler=="Bandaranaike, S"
{txt}(1 real change made)

{com}. replace year11=1978.7 if ruler=="Taraki"
{txt}(1 real change made)

{com}. replace year11=1955.7 if ruler=="Chaudhri M. Ali"
{txt}(1 real change made)

{com}. replace year11=1957.3 if ruler=="Fignole"
{txt}(1 real change made)

{com}. replace year11=1963.7 if ruler=="Paz Estenssoro"
{txt}(1 real change made)

{com}. replace year11=1967.7 if ruler=="Robles"
{txt}(1 real change made)

{com}. replace year11=1939.7 if ruler=="Estigarribia"
{txt}(1 real change made)

{com}. replace year11=1947.7 if ruler=="Higinio Morinigo"
{txt}(1 real change made)

{com}. replace year11=1950.7 if ruler=="Urriolagoitia"
{txt}(1 real change made)

{com}. 
. replace year11=1974.7 if ruler=="Mujib Rahman"
{txt}(1 real change made)

{com}. replace year11=1962.7 if ruler=="L. Somoza"
{txt}(1 real change made)

{com}. replace year11=1950.7 if ruler=="Arias, A."
{txt}(1 real change made)

{com}. replace year11=1944.7 if ruler=="la Guardia"
{txt}(1 real change made)

{com}. replace year11=1934.7 if ruler=="Velasco Ibarra"
{txt}(1 real change made)

{com}. replace year11=1929.7 if ruler=="Liles"
{txt}(1 real change made)

{com}. replace year11=1924.7 if ruler=="Saavedra"
{txt}(1 real change made)

{com}. replace year11=1925.7 if ruler=="Orellana"
{txt}(1 real change made)

{com}. replace year11=1923.7 if ruler=="Lopez Gutierrez"
{txt}(1 real change made)

{com}. replace year11=1918.7 if ruler=="Bertrand"
{txt}(1 real change made)

{com}. 
. 
. 
.    twoway (rbar starty endy ruler2 if order==0, horizontal barwidth(.4) bcolor(gs14) ) ///
>   (rbar year11 endy ruler2 if order==0, horizontal barwidth(.4) bcolor(gs1)) ///
>     (rbar year2 endy ruler2 if order==0 & year11!=year2, horizontal barwidth(.4) ), ///
>    ylabel(2(1)55, labsize(tiny) valuelabel alternate angle(0))  ytitle("") ///
>   xlabel(1990(10)2020, grid)  xlabel( , labsize(small)) legend(off) xsize(10) ysize(8) graphr(m(l-3 ))
{res}{txt}
{com}. graph export appendix/describe1.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/describe1.pdf written in PDF format)

{com}. 
.   
.    twoway (rbar starty endy ruler2 if order==1, horizontal barwidth(.4) bcolor(gs14) ) ///
>   (rbar year11 endy ruler2 if order==1, horizontal barwidth(.4) bcolor(gs1)) ///
>     (rbar year2 endy ruler2 if order==1 & year11!=year2, horizontal barwidth(.4) ), ///
>    ylabel(56(1)110, labsize(tiny) valuelabel alternate angle(0))  ytitle("") ///
>   xlabel(1980(10)2010, grid)  xlabel( , labsize(small)) legend(off) xsize(10) ysize(8) graphr(m(l-3 ))
{res}{txt}
{com}. graph export appendix/describe2.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/describe2.pdf written in PDF format)

{com}. 
.     twoway (rbar starty endy ruler2 if order==2, horizontal barwidth(.4) bcolor(gs14) ) ///
>   (rbar year11 endy ruler2 if order==2, horizontal barwidth(.4) bcolor(gs1)) ///
>     (rbar year2 endy ruler2 if order==2 & year11!=year2, horizontal barwidth(.4) ), ///
>    ylabel(111(1)166, labsize(tiny) valuelabel alternate angle(0))  ytitle("") ///
>   xlabel(1960(10)2010, grid)  xlabel( , labsize(small)) legend(off) xsize(10) ysize(8) graphr(m(l-3 ))
{res}{txt}
{com}. graph export appendix/describe3.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/describe3.pdf written in PDF format)

{com}. 
.     twoway (rbar starty endy ruler2 if order==3, horizontal barwidth(.4) bcolor(gs14) ) ///
>   (rbar year11 endy ruler2 if order==3, horizontal barwidth(.4) bcolor(gs1)) ///
>     (rbar year2 endy ruler2 if order==3 & year11!=year2, horizontal barwidth(.4) ), ///
>    ylabel(167(1)222, labsize(tiny) valuelabel alternate angle(0))  ytitle("") ///
>   xlabel(1950(10)2000, grid)  xlabel( , labsize(small)) legend(off) xsize(10) ysize(8) graphr(m(l-3 ))
{res}{txt}
{com}. graph export appendix/describe4.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/describe4.pdf written in PDF format)

{com}. 
. 
.     twoway (rbar starty endy ruler2 if order==4, horizontal barwidth(.4) bcolor(gs14) ) ///
>   (rbar year11 endy ruler2 if order==4, horizontal barwidth(.4) bcolor(gs1)) ///
>     (rbar year2 endy ruler2 if order==4 & year11!=year2, horizontal barwidth(.4) ), ///
>    ylabel(223(1)279, labsize(tiny) valuelabel alternate angle(0))  ytitle("") ///
>   xlabel(1920(10)1970, grid)  xlabel( , labsize(small)) legend(off) xsize(10) ysize(8) graphr(m(l-3 ))
{res}{txt}
{com}. graph export appendix/describe5.pdf, replace
{txt}(file /Users/alexbaturo/Desktop/jpr/ReplicationFile/appendix/describe5.pdf written in PDF format)

{com}.  
. 
. 
. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/alexbaturo/Desktop/jpr/ReplicationFile/log_appendix.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 2 Jul 2021, 10:43:36
{txt}{.-}
{smcl}
{txt}{sf}{ul off}